## Questions types (sources fiables, testées en piscines ou examens data/IA) sur les dicts

Compter la fréquence des mots dans un texte

    Entrée: chaîne de caractères

    Sortie: dictionnaire {mot: fréquence}

    Méthodes clés: get, items

In [23]:
from collections import Counter as ct

def counterOccur(texte):
  return ct(texte)

def main():
  texte = input("Entrer le texte : ")
  compteur = counterOccur(texte)
  print("Le nombre d'occurences de chaque caractère est :")
  for caractere, occurence in compteur.items():
    print(f"{caractere} : {occurence}") 

main()

Le nombre d'occurences de chaque caractère est :
a : 3
l : 3
o : 2
m : 1
  : 9
t : 4
u : 3
e : 4
s : 3
f : 1
r : 1
p : 1
i : 2
c : 2
n : 1
' : 1
d : 1
j : 1
v : 1
x : 1

In [28]:
def compteOccur2(texte):
  occur = {}
  for  c in texte:
    if c in occur: 
      occur[c] += 1
    else :
      occur[c] = 1
  return occur

print(compteOccur("alloma"))

{'a': 2, 'l': 2, 'o': 1, 'm': 1}

In [29]:
def compteOccure3(texte):
  occur = {}
  for c in texte:
    if c in occur:
      occur[c] = occur.get(c, o)+1
  return occur
compteOccur("alloma")

{'a': 2, 'l': 2, 'o': 1, 'm': 1}

Inverser un dictionnaire (groupement par valeurs)

    Ex: dico {clé: valeur} → {valeur: [liste des clés]}

    Méthodes clés: setdefault, items

Counter({'a': 2, 'l': 2, 'o': 1, 'm': 1})

Trier un dictionnaire par valeurs décroissantes

    Ex: Top N mots les plus fréquents

    Méthodes clés: sorted, items

Fusionner plusieurs dictionnaires de résultats

    Ex: Combiner plusieurs résultats partiels

    Méthodes clés: update

Filtrer un dictionnaire selon une condition sur les valeurs

    Ex: garder les mots dont la fréquence > seuil

    Méthodes clés: compréhension de dict, items

In [1]:
import pandas as pd


data = {
    'Nom': ['Alloma', 'Luc', 'Neymar'],
    'Âge': [21, 22, 32],
    'Note': [18.5, 17.2, 19.7]
}

df = pd.DataFrame(data)
print(df)

      Nom  Âge  Note
0  Alloma   21  18.5
1     Luc   22  17.2
2  Neymar   32  19.7

In [2]:
df.head()

      Nom  Âge  Note
0  Alloma   21  18.5
1     Luc   22  17.2
2  Neymar   32  19.7

In [3]:
df.tail(2)

      Nom  Âge  Note
1     Luc   22  17.2
2  Neymar   32  19.7

In [6]:
df.shape

(3, 3)

In [7]:
df.columns

Index(['Nom', 'Âge', 'Note'], dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nom     3 non-null      object
 1   Âge     3 non-null      int64
 2   Note    3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 204.0+ bytes

In [10]:
df.describe()

             Âge       Note
count   3.000000   3.000000
mean   25.000000  18.466667
std     6.082763   1.250333
min    21.000000  17.200000
25%    21.500000  17.850000
50%    22.000000  18.500000
75%    27.000000  19.100000
max    32.000000  19.700000

In [11]:
df['Nom']

0    Alloma
1       Luc
2    Neymar
Name: Nom, dtype: object

In [13]:
df['Âge']

0    21
1    22
2    32
Name: Âge, dtype: int64

In [15]:
df[['Nom', 'Âge']]

      Nom  Âge
0  Alloma   21
1     Luc   22
2  Neymar   32

In [17]:
df.loc[0]

Nom     Alloma
Âge         21
Note      18.5
Name: 0, dtype: object

In [18]:
df.iloc[0]

Nom     Alloma
Âge         21
Note      18.5
Name: 0, dtype: object

In [22]:
df[df['Âge'] > 1]

      Nom  Âge  Note
0  Alloma   21  18.5
1     Luc   22  17.2
2  Neymar   32  19.7

In [24]:
df[(df['Âge']>21) & (df['Note'] > 10)]

      Nom  Âge  Note
1     Luc   22  17.2
2  Neymar   32  19.7

In [32]:
sum = df['Note'].sum()
tri = df.sort_values('Note', ascending=False)
print(tri)
print()
print(sum)

      Nom  Âge  Note
2  Neymar   32  19.7
0  Alloma   21  18.5
1     Luc   22  17.2

55.400000000000006

In [33]:
df.to_csv('data.csv', index = True)

In [39]:
df.groupby('Nom').std()

        Âge  Note
Nom
Alloma  NaN   NaN
Luc     NaN   NaN
Neymar  NaN   NaN

In [46]:
df['Âge'] = df['Âge'].apply(lambda x: x + 1)
df['status'] = df['Âge'].apply(lambda x: "jeune" if x < 25 else "adulte")
df

      Nom  Âge  Note  status
0  Alloma   26  18.5  adulte
1     Luc   27  17.2  adulte
2  Neymar   37  19.7  adulte